grevaillot/svd_tools/headers/ATSAM4SP32A/usart1.h
/** @defgroup usart1_idr_spi_mode IDRSPIMODE Interrupt Disable Register
@{*/

/** USART1_IDR_SPI_MODE_UNRE SPI Underrun Error Interrupt Disable **/
#define USART1_IDR_SPI_MODE_UNRE		(1 << 10)
/** USART1_IDR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Disable **/
#define USART1_IDR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_IDR_SPI_MODE_OVRE Overrun Error Interrupt Disable **/
#define USART1_IDR_SPI_MODE_OVRE		(1 << 5)
/** USART1_IDR_SPI_MODE_TXRDY TXRDY Interrupt Disable **/
#define USART1_IDR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_IDR_SPI_MODE_RXRDY RXRDY Interrupt Disable **/
#define USART1_IDR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_imr IMR Interrupt Mask Register
@{*/

/** USART1_IMR_MANE Manchester Error Interrupt Mask **/
#define USART1_IMR_MANE		(1 << 24)
/** USART1_IMR_CTSIC Clear to Send Input Change Interrupt Mask **/
#define USART1_IMR_CTSIC		(1 << 19)
/** USART1_IMR_NACK Non AcknowledgeInterrupt Mask **/
#define USART1_IMR_NACK		(1 << 13)
/** USART1_IMR_RXBUFF Buffer Full Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_RXBUFF		(1 << 12)
/** USART1_IMR_TXBUFE Buffer Empty Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_TXBUFE		(1 << 11)
/** USART1_IMR_ITER Max Number of Repetitions Reached Interrupt Mask **/
#define USART1_IMR_ITER		(1 << 10)
/** USART1_IMR_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART1_IMR_TXEMPTY		(1 << 9)
/** USART1_IMR_TIMEOUT Time-out Interrupt Mask **/
#define USART1_IMR_TIMEOUT		(1 << 8)
/** USART1_IMR_PARE Parity Error Interrupt Mask **/
#define USART1_IMR_PARE		(1 << 7)
/** USART1_IMR_FRAME Framing Error Interrupt Mask **/
#define USART1_IMR_FRAME		(1 << 6)
/** USART1_IMR_OVRE Overrun Error Interrupt Mask **/
#define USART1_IMR_OVRE		(1 << 5)
/** USART1_IMR_ENDTX End of Transmit Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_ENDTX		(1 << 4)
/** USART1_IMR_ENDRX End of Receive Transfer Interrupt Mask (available in all USART modes of operation) **/
#define USART1_IMR_ENDRX		(1 << 3)
/** USART1_IMR_RXBRK Receiver Break Interrupt Mask **/
#define USART1_IMR_RXBRK		(1 << 2)
/** USART1_IMR_TXRDY TXRDY Interrupt Mask **/
#define USART1_IMR_TXRDY		(1 << 1)
/** USART1_IMR_RXRDY RXRDY Interrupt Mask **/
#define USART1_IMR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_imr_spi_mode IMRSPIMODE Interrupt Mask Register
@{*/

/** USART1_IMR_SPI_MODE_UNRE SPI Underrun Error Interrupt Mask **/
#define USART1_IMR_SPI_MODE_UNRE		(1 << 10)
/** USART1_IMR_SPI_MODE_TXEMPTY TXEMPTY Interrupt Mask **/
#define USART1_IMR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_IMR_SPI_MODE_OVRE Overrun Error Interrupt Mask **/
#define USART1_IMR_SPI_MODE_OVRE		(1 << 5)
/** USART1_IMR_SPI_MODE_TXRDY TXRDY Interrupt Mask **/
#define USART1_IMR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_IMR_SPI_MODE_RXRDY RXRDY Interrupt Mask **/
#define USART1_IMR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_csr CSR Channel Status Register
@{*/

/** USART1_CSR_MANERR Manchester Error **/
#define USART1_CSR_MANERR		(1 << 24)
/** USART1_CSR_CTS Image of CTS Input **/
#define USART1_CSR_CTS		(1 << 23)
/** USART1_CSR_CTSIC Clear to Send Input Change Flag **/
#define USART1_CSR_CTSIC		(1 << 19)
/** USART1_CSR_NACK Non AcknowledgeInterrupt **/
#define USART1_CSR_NACK		(1 << 13)
/** USART1_CSR_RXBUFF Reception Buffer Full **/
#define USART1_CSR_RXBUFF		(1 << 12)
/** USART1_CSR_TXBUFE Transmission Buffer Empty **/
#define USART1_CSR_TXBUFE		(1 << 11)
/** USART1_CSR_ITER MaxNumber of Repetitions Reached **/
#define USART1_CSR_ITER		(1 << 10)
/** USART1_CSR_TXEMPTY Transmitter Empty **/
#define USART1_CSR_TXEMPTY		(1 << 9)
/** USART1_CSR_TIMEOUT Receiver Time-out **/
#define USART1_CSR_TIMEOUT		(1 << 8)
/** USART1_CSR_PARE Parity Error **/
#define USART1_CSR_PARE		(1 << 7)
/** USART1_CSR_FRAME Framing Error **/
#define USART1_CSR_FRAME		(1 << 6)
/** USART1_CSR_OVRE Overrun Error **/
#define USART1_CSR_OVRE		(1 << 5)
/** USART1_CSR_ENDTX End of Transmitter Transfer **/
#define USART1_CSR_ENDTX		(1 << 4)
/** USART1_CSR_ENDRX End of Receiver Transfer **/
#define USART1_CSR_ENDRX		(1 << 3)
/** USART1_CSR_RXBRK Break Received/End of Break **/
#define USART1_CSR_RXBRK		(1 << 2)
/** USART1_CSR_TXRDY Transmitter Ready **/
#define USART1_CSR_TXRDY		(1 << 1)
/** USART1_CSR_RXRDY Receiver Ready **/
#define USART1_CSR_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_csr_spi_mode CSRSPIMODE Channel Status Register
@{*/

/** USART1_CSR_SPI_MODE_UNRE Underrun Error **/
#define USART1_CSR_SPI_MODE_UNRE		(1 << 10)
/** USART1_CSR_SPI_MODE_TXEMPTY Transmitter Empty **/
#define USART1_CSR_SPI_MODE_TXEMPTY		(1 << 9)
/** USART1_CSR_SPI_MODE_OVRE Overrun Error **/
#define USART1_CSR_SPI_MODE_OVRE		(1 << 5)
/** USART1_CSR_SPI_MODE_TXRDY Transmitter Ready **/
#define USART1_CSR_SPI_MODE_TXRDY		(1 << 1)
/** USART1_CSR_SPI_MODE_RXRDY Receiver Ready **/
#define USART1_CSR_SPI_MODE_RXRDY		(1 << 0)

/**@}*/

/** @defgroup usart1_rhr RHR Receiver Holding Register
@{*/

/** USART1_RHR_RXSYNH Received Sync **/
#define USART1_RHR_RXSYNH		(1 << 15)

#define USART1_RHR_RXCHR_SHIFT		0
#define USART1_RHR_RXCHR_MASK		0x1ff
/** @defgroup usart1_rhr_rxchr RXCHR Received Character
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_thr THR Transmitter Holding Register
@{*/

/** USART1_THR_TXSYNH Sync Field to be Transmitted **/
#define USART1_THR_TXSYNH		(1 << 15)

#define USART1_THR_TXCHR_SHIFT		0
#define USART1_THR_TXCHR_MASK		0x1ff
/** @defgroup usart1_thr_txchr TXCHR Character to be Transmitted
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_brgr BRGR Baud Rate Generator Register
@{*/


#define USART1_BRGR_FP_SHIFT		16
#define USART1_BRGR_FP_MASK		0x07
/** @defgroup usart1_brgr_fp FP Fractional Part
@{*/
/**@}*/


#define USART1_BRGR_CD_SHIFT		0
#define USART1_BRGR_CD_MASK		0xffff
/** @defgroup usart1_brgr_cd CD Clock Divider
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_rtor RTOR Receiver Time-out Register
@{*/


#define USART1_RTOR_TO_SHIFT		0
#define USART1_RTOR_TO_MASK		0xffff
/** @defgroup usart1_rtor_to TO Time-out Value
@{*/
/**@}*/


/**@}*/

/** @defgroup usart1_ttgr TTGR Transmitter Timeguard Register
@{*/


